{
    "weight_map": {
        "lm_head.biases": "model-00001-of-00002.safetensors",
        "lm_head.scales": "model-00002-of-00002.safetensors",
        "lm_head.weight": "model-00001-of-00002.safetensors",
        "model.embed_tokens.biases": "model-00002-of-00002.safetensors",
        "model.embed_tokens.scales": "model-00001-of-00002.safetensors",
        "model.embed_tokens.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_norm.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.q_norm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.k_norm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_norm.weight": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.norm.weight": "model-00001-of-00002.safetensors"
    }
}
